---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCGeometryInfo.GetSurfaces
source: html/70ea4451-78f1-6a56-2d5d-c062edbd4f1f.htm
---
# Autodesk.Revit.DB.IFC.IFCGeometryInfo.GetSurfaces Method

Gets the IfcSurface handles created representing the processed geometry and stored in this object.

## Syntax (C#)
```csharp
public ICollection<IFCAnyHandle> GetSurfaces()
```

## Returns
The collection of surface handles.